---
kind: method
id: M:Autodesk.Revit.DB.Electrical.AreaBasedLoadData.GetElectricalLoadAreas
source: html/05745395-b4f0-44ec-8732-93a4147b60b0.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadData.GetElectricalLoadAreas Method

Gets electrical load areas which the area based load includes.

## Syntax (C#)
```csharp
public ISet<ElementId> GetElectricalLoadAreas()
```